In [205]:
import pandas as pd

In [206]:
df=pd.read_csv(r"C:\Users\HP\Downloads\Google_Stock_Price_Test.csv")
df

         Date    Open    High     Low   Close     Volume
0    1/3/2017  778.81  789.63  775.80  786.14  1,657,300
1    1/4/2017  788.36  791.34  783.16  786.90  1,073,000
2    1/5/2017  786.08  794.48  785.02  794.02  1,335,200
3    1/6/2017  795.26  807.90  792.20  806.15  1,640,200
4    1/9/2017  806.40  809.97  802.83  806.65  1,272,400
5   1/10/2017  807.86  809.13  803.51  804.79  1,176,800
6   1/11/2017  805.00  808.15  801.37  807.91  1,065,900
7   1/12/2017  807.14  807.39  799.17  806.36  1,353,100
8   1/13/2017  807.48  811.22  806.69  807.88  1,099,200
9   1/17/2017  807.08  807.14  800.37  804.61  1,362,100
10  1/18/2017  805.81  806.21  800.99  806.07  1,294,400
11  1/19/2017  805.12  809.48  801.80  802.17    919,300
12  1/20/2017  806.91  806.91  801.69  805.02  1,670,000
13  1/23/2017  807.25  820.87  803.74  819.31  1,963,600
14  1/24/2017  822.30  825.90  817.82  823.87  1,474,000
15  1/25/2017  829.62  835.77  825.06  835.67  1,494,500
16  1/26/2017  837.81  838.00  827.01  832.15  2,973,900
17  1/27/2017  834.71  841.95  820.44  823.31  2,965,800
18  1/30/2017  814.66  815.84  799.80  802.32  3,246,600
19  1/31/2017  796.86  801.25  790.52  796.79  2,160,600

In [207]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [208]:
df.shape

(20, 6)

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Open    20 non-null     float64
 2   High    20 non-null     float64
 3   Low     20 non-null     float64
 4   Close   20 non-null     float64
 5   Volume  20 non-null     object
dtypes: float64(4), object(2)
memory usage: 1.1+ KB

In [210]:
df.isnull().sum()

Date      0
Open      0
High      0
Low       0
Close     0
Volume    0
dtype: int64

In [211]:
from sklearn import preprocessing
label_encoder=preprocessing.LabelEncoder()
df['Date']=label_encoder.fit_transform(df['Date'])
df['Date'].unique()

array([13, 16, 17, 18, 19,  0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11,
       12, 14, 15])

In [212]:
from sklearn import preprocessing
label_encoder=preprocessing.LabelEncoder()
df['Volume']=label_encoder.fit_transform(df['Volume'])
df['Volume'].unique()

array([12,  1,  6, 11,  4,  3,  0,  7,  2,  8,  5, 19, 13, 14,  9, 10, 17,
       16, 18, 15])

In [213]:
x=df[['Date','Open','High','Low','Close']]
x

    Date    Open    High     Low   Close
0     13  778.81  789.63  775.80  786.14
1     16  788.36  791.34  783.16  786.90
2     17  786.08  794.48  785.02  794.02
3     18  795.26  807.90  792.20  806.15
4     19  806.40  809.97  802.83  806.65
5      0  807.86  809.13  803.51  804.79
6      1  805.00  808.15  801.37  807.91
7      2  807.14  807.39  799.17  806.36
8      3  807.48  811.22  806.69  807.88
9      4  807.08  807.14  800.37  804.61
10     5  805.81  806.21  800.99  806.07
11     6  805.12  809.48  801.80  802.17
12     7  806.91  806.91  801.69  805.02
13     8  807.25  820.87  803.74  819.31
14     9  822.30  825.90  817.82  823.87
15    10  829.62  835.77  825.06  835.67
16    11  837.81  838.00  827.01  832.15
17    12  834.71  841.95  820.44  823.31
18    14  814.66  815.84  799.80  802.32
19    15  796.86  801.25  790.52  796.79

In [214]:
y=df[['Volume']]
y

    Volume
0       12
1        1
2        6
3       11
4        4
5        3
6        0
7        7
8        2
9        8
10       5
11      19
12      13
13      14
14       9
15      10
16      17
17      16
18      18
19      15

In [215]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.2)

In [216]:
xtrain.shape

(16, 5)

In [217]:
xtest.shape

(4, 5)

In [218]:
ytrain.shape

(16, 1)

In [219]:
ytest.shape

(4, 1)

In [220]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     int32
 1   Open    20 non-null     float64
 2   High    20 non-null     float64
 3   Low     20 non-null     float64
 4   Close   20 non-null     float64
 5   Volume  20 non-null     int32
dtypes: float64(4), int32(2)
memory usage: 928.0 bytes

In [ ]:
#LOGISITIC REGRESSION//

In [197]:
# from sklearn.metrics import mean_squared_error,r2_score
# from sklearn.linear_model import LogisticRegression
# reg=LogisticRegression()
# reg.fit(xtrain,ytrain)
# ypred=reg.predict(xtest)
# mse= mean_squared_error(ytest,ypred)
# print(mse)
# r_squared = r2_score(ytest,ypred)
# print(r_squared)

81.0
-0.8540772532188841

C:\Users\HP\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)
C:\Users\HP\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [ ]:
#LINEAR REGRESSION//

In [198]:
# from sklearn.metrics import mean_squared_error,r2_score
# from sklearn.linear_model import LinearRegression
# reg=LinearRegression()
# reg.fit(xtrain,ytrain)
# ypred=reg.predict(xtest)
# mse= mean_squared_error(ytest,ypred)
# print(mse)
# r_squared = r2_score(ytest,ypred)
# r_squared

90.08351154814194

-1.0619974031048227

In [ ]:
#SUPPORT VECTOR MACHINE//

In [195]:
# from sklearn.svm import SVC
# clf=SVC()
# clf.fit(xtrain,ytrain)
# ypred=clf.predict(xtest)
# score=accuracy_score(ytest,ypred)
# score

C:\Users\HP\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

0.0

In [ ]:
#RANDOM FOREST CLASSIFIER

In [222]:
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier
reg=RandomForestClassifier()
reg.fit(x,y)
ypred=reg.predict(xtest)
score=accuracy_score(ytest,ypred)n
score

C:\Users\HP\AppData\Local\Temp/ipykernel_8648/291313136.py:4: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  reg.fit(x,y)

1.0